{
  "navText1": "Home",
  "navText2": "About",
  "navText3": "Skills",
  "navText4": "Services",
  "navText5": "Portfolio",
  "navText6": "Resume",
  "navText7": "Questions",
  "navText8": "Contact",

  "heroText1": "Elevating User Experience Through Code",
  "heroText2": "Learning UX/UI Design",
  "heroText3": "Welcome to my website! I'm comfortable working on both front-end and back-end development. I specialize in crafting <bold className=' text-royalPurpleText font-medium'>user-friendly</bold> and <bold className=' text-royalPurpleText font-medium'>very detailed</bold> websites.",
  "heroText4": "Available for Freelance & Employment",
  "heroText5": "Portfolio Showcase",
  "heroText6": "View Resume",
  "heroText7": "Contact Me",

  "aboutText1": "About Me",
  "aboutText2": "Web Developer",
  "aboutText3": "I'm <bold className=' text-royalPurpleText font-medium'> Carlos Henrique</bold>, a <bold className=' text-skyBlueText'>Web Developer</bold> based in <bold className='brazil-gradient'>Brazil</bold>. With some experience in both <bold className=' italic'>front-end and back-end development</bold>, I specialize in creating <bold className=' text-cornflowerBlueText font-medium'>user-friendly websites</bold> that have a touch of <bold className=' text-royalPurpleText font-medium'>detail</bold> and <bold className=' text-skyBlueText'>vitality</bold>.",
  "aboutText4": "For me, <bold className=' font-medium'>problem-solving</bold> is at the core of web development. I believe that given enough time and determination, any challenge can be overcome. My focus is on crafting <bold className=' font-medium'>practical solutions</bold> and ensuring a <bold className=' text-royalPurpleText font-medium'>seamless user experience</bold> for every and all.",
  "aboutText5": "I may not delve into coding intricacies as much as others, but I'm all about <bold className=' text-cornflowerBlueText italic'>results</bold>. My <bold className=' text-royalPurpleText font-medium'>hands-on approach</bold> involves extensive study, iterative learning, and practical application. For me, it's about <bold className=' text-skyBlueText font-medium'>doing and improving through experience</bold>, rather than <bold className=' text-cornflowerBlueText font-medium'>theoretical matters</bold>.",
  "aboutText6": "If my approach resonates with you or if you have a project in mind, let's connect and bring your ideas to life together.",

  "skillsText1": "Web Skills Showcase",
  "skillsText2": "Discover my current skills for <bold className=' text-royalPurpleText font-medium'>web development</bold>. I believe I can do anything that other people can with all the skills presented here. While I don't know everything, I'm always learning and improving so I can deliver a better experience to all. <bold className='text-white75'>|</bold> <bold className='text-cornflowerBlueText font-medium'>*Click on a card to reveal more information about each skill.</bold>",
  "skillsText3": "Extra Note:",

  "skillsData": [
    {
      "id": 1,
      "name": "JavaScript",
      "description": "JavaScript is a versatile scripting language commonly used to create dynamic and interactive web pages. With its widespread adoption, it's an essential skill for front-end and back-end development.",
      "imageSrc": "/assets/javascript-logo.svg",
      "imageSrcBlack": "/assets/black-logos/javascript-logo.svg",
      "extraNote": "I've utilized JavaScript on a few Online Student Projects, implementing common features like Hamburger Menus, Image Slideshows, Dropdowns, and Modals. Although, it's nothing special that I don't do already on React / Nextjs. Anyway, I can always come back to it to make new projects and learn a bit more."
    },
    {
      "id": 2,
      "name": "CSS / SASS / SCSS",
      "description": "CSS (Cascading Style Sheets) is the language used to style HTML documents. It controls the layout and appearance of web pages, allowing developers to create visually appealing and responsive designs.",
      "imageSrc": "/assets/css-logo.svg",
      "imageSrcBlack": "/assets/black-logos/css-logo.svg",
      "extraNote": ""
    },
    {
      "id": 3,
      "name": "Node.js",
      "description": "Node.js is a server-side JavaScript runtime that allows developers to build scalable and efficient network applications. It's widely used for creating web servers and handling asynchronous tasks.",
      "imageSrc": "/assets/nodejs-logo.svg",
      "imageSrcBlack": "/assets/black-logos/nodejs-logo.svg",
      "extraNote": "I've applied Node.js in an online student project while concurrently learning React. The project focused on a social website, featuring user registration, login, post creation, editing, deletion, likes, comments, user profiles, and profile editing. Additional features included an AuthGuard, user validation, and more. Regrettably, the project remained incomplete due to its nature as an online learning exercise. I thought about completing it by strengthening the AuthGuard, implementing confirmation emails and phone numbers, refining post likes with algorithms, adding post filters, improving the overall design, enabling comment replies, incorporating notifications, friend lists, and other many, many features so it could be ready for production in a real-world scenario. However, the amount of work for creating a fully-fledged social media site completely alone felt like it would require a way too extreme amount of time invested in it, so I discarded the idea after doing it for a while."
    },
    {
      "id": 4,
      "name": "HTML",
      "description": "HTML (Hypertext Markup Language) is the foundation of web development. It structures content on the web, defining the elements that make up a webpage, such as headings, paragraphs, and images.",
      "imageSrc": "/assets/html-logo.svg",
      "imageSrcBlack": "/assets/black-logos/html-logo.svg",
      "extraNote": ""
    },
    {
      "id": 5,
      "name": "Next.js",
      "description": "Next.js is a React framework that simplifies the process of building server-side rendered and statically generated React applications. It enhances the performance and SEO of web applications.",
      "imageSrc": "/assets/nextjs-logo.svg",
      "imageSrcBlack": "/assets/black-logos/nextjs-logo.svg",
      "extraNote": "So far, my favorite. It's straightforward and kind of does some heavy lifting for you. As someone who likes to make websites that are user-friendly for everyone, having an easy-to-use programming language that makes things simpler for developers is definitely a huge plus for me, and I can definitely appreciate the effort put into it."
    },
    {
      "id": 6,
      "name": "React / React + Typescript",
      "description": "React is a JavaScript library for building user interfaces. It allows developers to create reusable components, making it efficient to build and maintain complex web applications.",
      "imageSrc": "/assets/react-logo.svg",
      "imageSrcBlack": "/assets/black-logos/react-logo.svg",
      "extraNote": ""
    },
    {
      "id": 7,
      "name": "Bootstrap",
      "description": "Bootstrap is a popular CSS framework that streamlines the process of designing responsive and visually appealing websites. It provides a set of pre-designed components and styles.",
      "imageSrc": "/assets/bootstrap-logo.svg",
      "imageSrcBlack": "/assets/black-logos/bootstrap-logo.svg",
      "extraNote": ""
    },
    {
      "id": 8,
      "name": "Figma",
      "description": "Figma is a collaborative design tool that allows designers to create, share, and collaborate on user interfaces in real-time. It's widely used for designing web and mobile applications.",
      "imageSrc": "/assets/figma-logo.svg",
      "imageSrcBlack": "/assets/black-logos/figma-logo.svg",
      "extraNote": ""
    },
    {
      "id": 9,
      "name": "Tailwind CSS",
      "description": "Tailwind CSS is a utility-first CSS framework that simplifies the process of styling web applications. It provides low-level utility classes to build designs quickly and maintainably.",
      "imageSrc": "/assets/tailwind-logo.svg",
      "imageSrcBlack": "/assets/black-logos/tailwind-logo.svg",
      "extraNote": "When I heard about the concept Bootstrap had to offer, this is exactly what I thought it would be. Using normal CSS/SASS/SCSS and even Bootstrap honestly feels like a waste when you have Tailwind CSS around. I 100% recommend it to all Developers out there."
    },
    {
      "id": 10,
      "name": "WordPress",
      "description": "WordPress is a content management system (CMS) that powers a significant portion of the web. It's used for building websites and blogs, offering a user-friendly interface and extensive plugin support.",
      "imageSrc": "/assets/wordpress-logo.svg",
      "imageSrcBlack": "/assets/black-logos/wordpress-logo.svg",
      "extraNote": "Like Strapi, I've solely used WordPress as a Headless CMS. Unfortunately, I haven't gone too deeply into WordPress, but I'm very inclined to explore it further in the future. The plugins it has to offer might make it a better choice than Strapi, and it may as well be less limiting and offer more freedom at the cost of possible being a bit tougher to use and manage as a Developer than Strapi was."
    },
    {
      "id": 11,
      "name": "Firebase",
      "description": "Firebase is a mobile and web application development platform provided by Google. It offers a suite of cloud services, including authentication, real-time databases, and hosting, simplifying backend development.",
      "imageSrc": "/assets/firebase-logo.svg",
      "imageSrcBlack": "/assets/black-logos/firebase-logo.svg",
      "extraNote": "I used it as a database for a social website in an online student project, storing photos of posts, profile pictures, user accounts, and more. I didn't do anything particularly special with it, and I believe similar results could be achieved with any other database without issues."
    },
    {
      "id": 12,
      "name": "Strapi",
      "description": "Strapi is an open-source headless CMS that enables developers to build powerful APIs quickly. It's flexible, customizable, and suitable for creating content-rich applications.",
      "imageSrc": "/assets/strapi-logo.svg",
      "imageSrcBlack": "/assets/black-logos/strapi-logo.svg",
      "extraNote": "I use Strapi as a content management for my Doggy Daycare project. From my perspective, Strapi felt more accessible and visually modern compared to WordPress when I started, as it was literally made to be a Headless CMS. However, as I explored further, the limitations in terms of plugins and features made me seriously question whether WordPress might have offered superior customization as a Headless CMS for the client's content. Honestly, I still have yet to try WordPress in depth to be able to tell if that was really the case."
    },
    {
      "id": 13,
      "name": "Other",
      "description": "The \"Other\" category represents my openness to learning new skills and technologies. Even if I haven't encountered a specific language or tool yet, I believe I can adapt and acquire the necessary knowledge to use it for production if I have a bit of time to spend learning it.",
      "imageSrc": "/assets/question-mark.svg",
      "imageSrcBlack": "/assets/black-logos/question-mark.svg",
      "extraNote": ""
    }
  ],

  "servicesText1": "Elevate Your Digital Presence with my Digital Services.",
  "servicesText2": "Explore a range of digital services that I offer. From <bold className=''>custom website development</bold> to <bold className=''>responsive designs</bold>, I try and improve every day so my services can not only meet your business needs but also enhance the <bold className='text-royalPurpleText font-medium'>usability</bold> and <bold className='text-royalPurpleText font-medium'>accessibility</bold> of your website for <bold className='text-skyBlueText font-medium'>you, your team, and all of the users from your website</bold>. Feel free to <bold className='text-cornflowerBlueText font-medium'>contact me</bold> using the form below if you have any questions about my services.",
  "servicesText3": "Are you interested in working with me?",
  "servicesText4": "Let’s get started now",

  "servicesData": [
    {
      "id": 1,
      "title": "Content Management Systems",
      "description": "While I'm still gaining experience with CMS tools, I'm committed to providing you with the best possible experience. I'll put in the effort to ensure your content management is straightforward and stress-free, allowing you to curate the perfect content for your Website.",
      "imageSrc": "/assets/dashboard.svg"
    },
    {
      "id": 2,
      "title": "Frontend & Backend Development",
      "description": "I handle both frontend and backend development tasks. If you have a gap in your project that needs filling, I'm here to help. While I'm still building experience, I'm ready to take on challenges and contribute to your project's development needs.",
      "imageSrc": "/assets/code-symbol.svg"
    },
    {
      "id": 3,
      "title": "UI/UX Design",
      "description": "While my design might not be as incredible as some, I approach UI/UX with dedication and a commitment to improvement. Given sufficient time, I can create functional, nice-looking and user-friendly designs made to fit your needs.",
      "imageSrc": "/assets/blueprint.svg"
    },
    {
      "id": 4,
      "title": "Responsive Design",
      "description": "It's essential to ensure that your website is accessible to everyone, independently of their machine screen size. Just like every Web Developer, I am able to create a seamless user experience that effortlessly adapts to diverse devices and screen sizes. Whether it's desktops or smartphones, your website will work across all platforms, providing an optimal viewing and user experience for every visitor.",
      "imageSrc": "/assets/target.svg"
    },
    {
      "id": 5,
      "title": "Ongoing Support & Content Updates",
      "description": "I can support your site beyond the initial development phase. I offer ongoing support and content updates to ensure your website works properly and is up-to-date. Whether it's troubleshooting an error, security enhancements, or even adding advanced fresh content that you can't do on your own, I am here to support the longevity and success of your online presence.",
      "imageSrc": "/assets/cogwheel.svg"
    },
    {
      "id": 6,
      "title": "SEO Optimization",
      "description": "Like every Web Developer, improving your online visibility is one of my services. Through thorough SEO optimization, I strategically position your website to reach a wider audience. From keyword research to on-page optimization, my approach is designed to enhance your digital presence and attract organic traffic to your site.",
      "imageSrc": "/assets/seo.svg"
    },
    {
      "id": 7,
      "title": "Web Accessibility (WCAG)",
      "description": "I'm committed to digital accessibility, ensuring my projects are user-friendly for everyone. While developing expertise in accessibility integration, I use tools like Screen Readers and consult guides for thorough testing. Acknowledging the diverse user experiences, I'm dedicated to continual learning and refinement. My goal is to create inclusive and user-friendly online experiences for everyone.",
      "imageSrc": "/assets/checkmark.svg"
    },
    {
      "id": 8,
      "title": "Fast Website",
      "description": "I prioritize speed to ensure an optimal user experience for your visitors. Through efficient coding practices and performance optimizations, I am dedicated to delivering a fast and responsive website. Everyone on the web deserves a seamless online journey, and I am committed to providing just that.",
      "imageSrc": "/assets/speed.svg"
    }
  ],

  "projectsText1": "Highlighted Works",
  "projectsText2": "While I've done various <bold className='text-royalPurpleText font-medium '>projects for learning only</bold>, this portfolio exclusively features my <bold className='text-royalPurpleText font-medium '>complete projects, distinct from one page learning exercises</bold>. Representing my personal work in design and code, these projects not only display my style but also integrate many skills I have learned soo far.",
  "projectsText3": "Description:",
  "projectsText4": "Site Features Include:",
  "projectsText5": "Website URL:",
  "projectsText6": "Read Case Study",

  "projectsData": [
    {
      "slug": "doggy-daycare",
      "icon": "/assets/paw-icon.svg",
      "iconAltText": "Dog Paws",
      "name": "Doggy Daycare",
      "description": "A project about a fictional Doggy Daycare. Although the Name isn't very creative, the Site was made only with the goal of self-improvement. It served as a platform to mainly enhance my design skills, and utilize a popular CMS tool such as Strapi and WordPress, as I'm quite a fan of the Idea of what a CMS can do. The project also aimed at refining my coding proficiency in Next.js, implementing accessibility features, and a few more.",
      "role": "(Sole Developer)",
      "descriptionFeatures": "Strapi CMS, Interactive Map, Automatic Email, Accessibility Integration, Loading Screen & Skeleton Loading.",
      "technologiesUsed": [
        {
          "name": "Next.js",
          "techImageSrc": "/assets/nextjs-logo.svg",
          "blackTechImageSrc": "/assets/black-logos/nextjs-logo.svg",
          "reasonWhy": "Next.js was chosen for its efficiency in building React applications and its default dynamic routes & config, allowing the Project to progress faster without needing too many custom configurations like custom Routes."
        },
        {
          "name": "Tailwind CSS",
          "techImageSrc": "/assets/tailwind-logo.svg",
          "blackTechImageSrc": "/assets/black-logos/tailwind-logo.svg",
          "reasonWhy": "Tailwind CSS was selected to streamline the styling process with its utility-first approach, ensuring a clean and maintainable codebase. It made styling the website be extremely fast. I honestly can't stress enough about how useful it was."
        },
        {
          "name": "Strapi",
          "techImageSrc": "/assets/strapi-logo.svg",
          "blackTechImageSrc": "/assets/black-logos/strapi-logo.svg",
          "reasonWhy": "Strapi served as the headless CMS to manage content, providing flexibility and ease of use, allowing for efficient content updates. Although, I wouldn't recommend it too much, as at least for me, I felt like quite a bit of features were lacking."
        },
        {
          "name": "Figma",
          "techImageSrc": "/assets/figma-logo.svg",
          "blackTechImageSrc": "/assets/black-logos/figma-logo.svg",
          "reasonWhy": "Figma was the main design tool; its plugins and features helped a lot, ensuring a cohesive and visually appealing user interface."
        },
        {
          "name": "CSS",
          "techImageSrc": "/assets/css-logo.svg",
          "blackTechImageSrc": "/assets/black-logos/css-logo.svg",
          "reasonWhy": "While Tailwind CSS was the primary styling tool, custom CSS was utilized for specific design elements, providing a better visual experience."
        }
      ],
      "challengesDescription": "While developing this project, I encountered minimal challenges, mostly centered around refining site details and handling repetitive tasks due to the CMS. The complexity of the project was relatively low, with the most complicated steps being only a little challenging in comparison.",
      "featuresDescription": "Explore the diverse range of features and functionality implemented in this project. From seamless content management to user-friendly interactions, each element is designed to enhance the overall user experience.",
      "challenges": [
        {
          "challengeTitle": "Reservation Form Enhancement",
          "challengeDescription": "Creating the reservation form had its challenges. While the main functions worked well—sending data to Strapi and triggering email notifications—the details of form validation and user experience needed improvement. Ensuring accessibility is uncertain without real users for testing, and as a learning project, I didn't want to inconvenience users solely for testing and learning purposes.",
          "solutionText": "To address these challenges, I refined the form's visual cues for better feedback and extensively tested it with NVDA Screen Reader. I also consulted online guides on form accessibility. However, determining the form's success remains challenging without real-world user interaction. Continuous improvement is completely possible and essential if the website was gonna be accessible to the public as a non-fictional project."
        }
      ],
      "siteMainFeatures": [
        {
          "featureHeading": "Strapi Headless CMS Integration:",
          "featureDescription": "Easily update Texts, Images, Videos, Job Posts, and Services."
        },
        {
          "featureHeading": "Interactive Leaflet Map:",
          "featureDescription": "Enables users to locate each facility efficiently."
        },
        {
          "featureHeading": "Accessibility Integration:",
          "featureDescription": "Screen Reader-friendly design, including the Interactive Map and Contact/Reservation Form."
        },
        {
          "featureHeading": "Graphic Details for a Vibrant Experience:",
          "featureDescription": "Number Counter, Confetti, Hover Effects on Images, and subtle animations for enhanced design."
        },
        {
          "featureHeading": "Automatic Email Notifications:",
          "featureDescription": "Sent to Strapi Admin and User upon successful form completion."
        },
        {
          "featureHeading": "HTML Animation Loading Screen:",
          "featureDescription": "Smooth loading animation while fetching data from Strapi."
        },
        {
          "featureHeading": "Custom Design Elements:",
          "featureDescription": "Self-made Logo, Dog-Themed Pattern, and a blend of Free Vectors created on Figma."
        },
        {
          "featureHeading": "Custom Video Thumbnail:",
          "featureDescription": "Custom thumbnail for a nice touch on the Open Positions Page."
        },
        {
          "featureHeading": "Images Interactions:",
          "featureDescription": "Click non-interactive images to open a modal displaying all of the Page Images, Ken Burns Effect on Open Positions Page, and Infinite Image Carousel working as a Gallery on each Individual Service Page."
        }
      ],
      "achievementsList": [
        {
          "achievementHeading": "Strapi Headless CMS Integration:",
          "achievementDescription": "Successfully integrated Strapi as a headless CMS, enabling easy updates for Texts, Images, Videos, Job Posts, and Services."
        },
        {
          "achievementHeading": "Interactive Leaflet Map:",
          "achievementDescription": "Implemented an interactive Leaflet map, allowing users to efficiently locate each facility."
        },
        {
          "achievementHeading": "Accessibility Integration:",
          "achievementDescription": "Designed a Screen Reader-friendly interface, including the Interactive Map and Contact/Reservation Form."
        },
        {
          "achievementHeading": "Graphic Details for a Vibrant Experience:",
          "achievementDescription": "Added engaging elements like Number Counter, Confetti, Hover Effects on Images, and subtle animations for enhanced design."
        },
        {
          "achievementHeading": "Automatic Email Notifications:",
          "achievementDescription": "Established automatic email notifications, sent to both Strapi Admin and Users upon successful form completion."
        },
        {
          "achievementHeading": "HTML Animation Loading Screen:",
          "achievementDescription": "Implemented a smooth loading animation while fetching data from Strapi."
        },
        {
          "achievementHeading": "Custom Design Elements:",
          "achievementDescription": "Created unique design elements, including a self-made logo, dog-themed pattern, and a blend of free vectors using Figma."
        },
        {
          "achievementHeading": "Custom Video Thumbnail:",
          "achievementDescription": "Crafted a custom thumbnail for a visually appealing touch on the Open Positions Page."
        },
        {
          "achievementHeading": "Images Interactions:",
          "achievementDescription": "Implemented interactive features such as clicking non-interactive images to open a modal, Ken Burns Effect on the Open Positions Page, and an Infinite Image Carousel functioning as a gallery on each Individual Service Page."
        }
      ],
      "websiteVideos": [
        {
          "videoSrcMp4": "/assets/projects/doggy-homepage.mp4",
          "videoSrcWebm": "/assets/projects/doggy-homepage.mp4"
        },
        {
          "videoSrcMp4": "/assets/projects/doggy-showcase.mp4",
          "videoSrcWebm": "/assets/projects/doggy-showcase.mp4"
        },
        {
          "videoSrcMp4": "/assets/projects/doggy-strapi.mp4",
          "videoSrcWebm": "/assets/projects/doggy-strapi.mp4"
        }
      ],
      "thumbnail": "/assets/projects/doggy-thumbnail.png",
      "thumbnailAltText": "Website Homepage Inside a Monitor Frame",
      "hero": "/assets/projects/doggy-hero.png",
      "liveWebsiteUrl": "https://doggy-daycare-front.vercel.app/"
    }
  ],
  "portfolioData": [
    {
      "name": "Web Dev Portfolio",
      "description": "My personal portfolio, crafted following the development of my Dog Daycare Website. It represents a significant improvement in terms of design, functionality, SEO, and accessibility. I made it with the goal of showcasing my skills, it serves as a convenient platform to present my current and future completed projects moving forward.",
      "role": "(Sole Developer)",
      "technologiesUsed": [
        {
          "name": "Next.js",
          "techImageSrc": "/assets/nextjs-logo.svg",
          "blackTechImageSrc": "/assets/black-logos/nextjs-logo.svg",
          "reasonWhy": ""
        },
        {
          "name": "Tailwind CSS",
          "techImageSrc": "/assets/tailwind-logo.svg",
          "blackTechImageSrc": "/assets/black-logos/tailwind-logo.svg",
          "reasonWhy": ""
        },
        {
          "name": "Figma",
          "techImageSrc": "/assets/figma-logo.svg",
          "blackTechImageSrc": "/assets/black-logos/figma-logo.svg",
          "reasonWhy": ""
        },
        {
          "name": "CSS",
          "techImageSrc": "/assets/css-logo.svg",
          "blackTechImageSrc": "/assets/black-logos/css-logo.svg",
          "reasonWhy": ""
        }
      ],
      "achievementsList": [
        {
          "achievementHeading": "Multilingual Website Implementation:",
          "achievementDescription": "Successfully implemented language change functionality using i18next, allowing users to switch between different languages for a more inclusive user experience."
        },
        {
          "achievementHeading": "Enhancements for a Better User Experience:",
          "achievementDescription": "Implemented a mechanism to save the selected language preference between sessions in Local Storage. Also Improved performance for a faster website. Additionally, search engines can now identify different language versions of the website."
        },
        {
          "achievementHeading": "Enhanced User Engagement with Animations:",
          "achievementDescription": "Implemented captivating animations and extra visual effects to enhance user engagement and create a more interactive and visually appealing website."
        },
        {
          "achievementHeading": "Improved Accessibility On Website:",
          "achievementDescription": "Successfully integrated improved accessibility features, ensuring the website is accessible to a diverse audience, including individuals with disabilities."
        },
        {
          "achievementHeading": "Automated Email System Implementation:",
          "achievementDescription": "Implemented an automated email system on Contact Form, streamlining communication processes and enhancing user engagement through email notifications."
        },
        {
          "achievementHeading": "Optimized Website for Search Engines (SEO):",
          "achievementDescription": "Successfully implemented SEO optimization strategies to improve the website's visibility on search engines."
        },
        {
          "achievementHeading": "Implemented Loading Screen and Skeleton Loading:",
          "achievementDescription": "Implemented a loading screen during Language Changes and employed skeleton loading techniques to significantly reduce layout shifts during page loading, ensuring a smoother user experience."
        }
      ],
      "liveWebsiteUrl": "https://www.carloshenriquedev.com/en"
    }
  ],
  "resumeText1": "Web Developer Resume: Skills and Achievements",
  "resumeText2": "View on Website / Download CV.",
  "resumeText3": "View On Website",
  "resumeText4": "Download CV",

  "faqText1": "Frequently Asked Questions",
  "faqText2": "Have any questions that haven't been answered here?",
  "faqText3": "Feel free to contact me below",

  "questionsData": [
    {
      "question": "1. How can I contact you?",
      "answer": "You can reach me through the contact form on my website. I'll get back to you as soon as possible."
    },
    {
      "question": "2. What services do you offer?",
      "answer": "I offer a range of digital services, including custom website development, responsive design, frontend and backend development, and more. Explore my Services section for details."
    },
    {
      "question": "3. Do you have experience with Content Management Systems (CMS)?",
      "answer": "Yes, I have experience with CMS like Strapi and a bit of WordPress. While I'm still learning, I'm committed to providing an easy and stress-free content management experience for your site."
    },
    {
      "question": "4. How do you ensure website accessibility?",
      "answer": "Ensuring digital accessibility is a top priority for me. I use tools like Screen Readers, stay updated on accessibility guidelines, and run tests to create inclusive and user-friendly online experiences. Lately, I have been thinking about even calling Free Online Accessibility Testers so they can test the accessibility of my Site and give me a lot of Feedback so I can improve."
    },
    {
      "question": "5. Can I update my website content myself?",
      "answer": "Absolutely! I can provide personalized training videos to empower you to manage common aspects of your website independently. From content updates to basic maintenance, I'm here to help you learn if necessary."
    },
    {
      "question": "6. What is your approach to SEO optimization?",
      "answer": "I focus on comprehensive SEO optimization, from keyword research to on-page optimization. My goal is to strategically position your website to reach a wider audience and drive organic traffic."
    },
    {
      "question": "7. How can I view your portfolio projects?",
      "answer": "You can explore my original projects in the Projects section of my portfolio. These projects showcase my skills in design and code, incorporating lessons learned from various learning projects."
    },
    {
      "question": "8. Do you provide ongoing support for websites?",
      "answer": "Yes, I offer ongoing support and content updates for websites. Whether you need assistance with maintenance or have questions about your site, I'm here to help."
    },
    {
      "question": "9. How do I inquire about your services?",
      "answer": "You can use the contact form on my website to inquire about my services. Feel free to share your project details, and I'll get back to you with more information."
    },
    {
      "question": "10. What is your process for website development?",
      "answer": "My process includes understanding your requirements, creating visually appealing and functional designs, and ensuring seamless adaptation to various devices. I value open communication and collaboration throughout the development journey."
    }
  ],

  "contactText1": "Ready to Collaborate?",
  "contactText2": "Contact Me",
  "contactText3": "Let's connect and explore your ideas. If you have a project in mind, are interested in collaboration, or have any questions, then feel free to reach out. I'm here to help and eager to hear from you.",

  "labelText1": "Name",
  "labelText2": "Email",
  "labelText3": "Message",

  "formButtonText1": "Submit",
  "formButtonText2": "Submit...",

  "placeHolderText1": "Your Name",
  "placeHolderText2": "Your Email",
  "placeHolderText3": "Your Message",

  "formErrorText1": "Name is required",
  "formErrorText2": "Email is required",
  "formErrorText3": "Invalid email address",
  "formErrorText4": "Message is required",

  "successText1": "Message Sent Successfully!",
  "successText2": "Return to Contact Form",

  "footerText1": "Carlos Henrique.",
  "footerText2": "Click Here to Open the Credits Tab",

  "resumePageText1": "Back to Top",
  "resumePageText2": "Back to Portfolio",
  "resumePageText3": "WEB DEVELOPER",
  "resumePageText4": "PERSONAL STATEMENT",
  "resumePageText5": "As a self-taught, all-around web developer, I learn new skills with dedication and persistence. While my formal education may be limited, my determination to improve and help other's is high. I invest countless hours daily into coding, crafting projects for learning, and tackling complex coding issues. Through a mix of video tutorials, guides, and thorough documentation, I've cultivated proficiency in design, frontend, and backend development. While I may not have the extensive real-world experience of professionals, I am confident in my ability to deliver high-quality work and meet the demands of any project.",
  "resumePageText6": "WEB DEV SKILLS",
  "resumePageText7": "PROJECTS",

  "resumePageProjectHeadingText1": "DESCRIPTION:",
  "resumePageProjectHeadingText2": "Technologies:",
  "resumePageProjectHeadingText3": "Achievements:",

  "resumePageText8": "EDUCATION",
  "resumePageText9": "SELF-TAUGHT WEB DEVELOPER",
  "resumePageText10": "ONLINE LEARNING",

  "educationList": [
    {
      "educationHeading": "Video Tutorials",
      "educationDescription": "Watch video tutorials on platforms like YouTube, where experts and educators share insights, tips, and practical demonstrations."
    },
    {
      "educationHeading": "Documentation Reading",
      "educationDescription": "Dive into official documentation of programming languages, frameworks, and tools. Gain a deep understanding of the features, functionalities, and practices outlined in documentation."
    },
    {
      "educationHeading": "Practical Projects",
      "educationDescription": "Undertake hands-on projects to apply knowledge in a practical setting. Worked on many projects for learning purposes that cover various aspects of web development."
    }
  ],

  "resumePageText11": "LANGUAGES",

  "languageList": [
    {
      "name": "Portuguese",
      "proficiency": "NATIVE SPEAKER",
      "description": "Native Portuguese speaker with fluency in speaking, writing, and listening. Comfortable communicating complex ideas and technical concepts in Portuguese. Proficient in understanding spoken Portuguese in various contexts."
    },
    {
      "name": "ENGLISH",
      "proficiency": "READING, WRITING AND LISTENING",
      "description": "Proficient in reading and writing English, with a strong ability to comprehend technical content. While I don't have a great vocal skill, I am comfortable reading, writing, and a bit of listening to voices in English, especially in the context of coding, documentation, and communication through written channels."
    }
  ],

  "projectsPageText1": "View Website Online",
  "projectsPageText2": "Figma Design File",
  "projectsPageText3": "Repository On Github",
  "projectsPageText4": "Challenges:",
  "projectsPageText5": "Features:",
  "projectsPageText6": "Download Video",
  "projectsPageText7": "Pages Quick Overview:",
  "projectsPageText8": "View More Online On Website",

  "accessibilityText1": "Skip To Main Content",
  "accessibilityText2": "Close Menu",
  "accessibilityText3": "Open Menu",
  "accessibilityText4": "Close Language Switch Menu",
  "accessibilityText5": "Open Menu to Switch Languages",
  "accessibilityText6": "Close Credits Dropdown",
  "accessibilityText7": "Open Credits Dropdown",
  "accessibilityText8": ", Open in a new Tab",
  "accessibilityText9": ", Click to show a quick preview. Information about this Project",
  "accessibilityText10": "Click to show more Information",
  "accessibilityText11": "Contact Form below, provide your Name, your Email, and your Message.",
  "accessibilityText12": "A Error Ocurred while trying to Submit the Form. Please, try again later.",

  "altText1": "Forward arrow",
  "altText2": "Brazilian flag",
  "altText3": "Flag of the United States",
  "altText4": "Toggle dropdown arrow",
  "altText5": "Programming illustration",
  "altText6": "Success checkmark surrounded by stars",
  "altText7": "Paper Plane",
  "altText8": "Star shape",
  "altText9": "Get Download file",
  "altText10": "Service Illustration for:",
  "altText11": "Return arrow",
  "altText12": "Website Planet Illustration",
  "altText13": "Figma Logo Illustration",
  "altText14": "Github Repository Illustration",
  "altText15": "Outside Link Symbol",

  "titleText1": "resume"
}
